package com.ard.weather.activity.entity;

/**
 * Created by Administrator on 2017/3/2.
 */

public class B {

    
    public static final String  str="{" +
            "\"showapi_res_code\": 0," +
            "\"showapi_res_error\": \"\"," +
            "\"showapi_res_body\": {" +
            "\"f6\": {" +
            "\"day_weather\": \"多云\"," +
            "\"night_weather\": \"晴\"," +
            "\"night_weather_code\": \"00\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气较好，适宜约会\"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"不适宜\"," +
            "\"desc\": \"天气阴沉，不太适宜晾晒。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"不适宜钓鱼\"," +
            "\"desc\": \"天气不好，不适合垂钓\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较差\"," +
            "\"desc\": \"气温较低，会让人觉得有些压抑。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风大，需注意及时添衣。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"较易发\"," +
            "\"desc\": \"天较凉，增加衣服，注意防护。\"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风稍大，出门逛街前记得给秀发定型。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较差\"," +
            "\"desc\": \"冷，感觉不舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"良\"," +
            "\"desc\": \"气象条件有利于空气污染物扩散。\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"无雨且风力较小，易保持清洁度。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"6%\"," +
            "\"night_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_wind_power\": \"3-4级 5.5~7.9m/s\"," +
            "\"day_weather_code\": \"01\"," +
            "\"sun_begin_end\": \"06:40|18:12\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/01.png\"," +
            "\"weekday\": 2," +
            "\"night_air_temperature\": \"-1\"," +
            "\"day_air_temperature\": \"10\"," +
            "\"day_wind_direction\": \"西北风\"," +
            "\"day\": \"20170307\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/00.png\"," +
            "\"night_wind_direction\": \"北风\"" +
            "}," +
            "\"f7\": {" +
            "\"day_weather\": \"晴\"," +
            "\"night_weather\": \"晴\"," +
            "\"night_weather_code\": \"00\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"不用担心天气来调皮捣乱而影响了兴致。 \"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气不错，抓紧时机让衣物晒太阳吧。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气稍凉会对垂钓产生一定影响。\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"温较低，推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"好天气会带来一天的好心情。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"气温低注意及时添衣，小心着凉。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"较易发\"," +
            "\"desc\": \"天凉温差大，适当增减衣服。 昼夜温差很大，注意预防感冒。  \"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"这种好天气去逛街可使身心畅快放松。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"普遍感觉舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"中\"," +
            "\"desc\": \"易感人群应适当减少室外活动。\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"无雨且风力较小，易保持清洁度。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"0%\"," +
            "\"night_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_weather_code\": \"00\"," +
            "\"sun_begin_end\": \"06:38|18:13\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/00.png\"," +
            "\"weekday\": 3," +
            "\"night_air_temperature\": \"-1\"," +
            "\"day_air_temperature\": \"12\"," +
            "\"day_wind_direction\": \"西北风\"," +
            "\"day\": \"20170308\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/00.png\"," +
            "\"night_wind_direction\": \"北风\"" +
            "}," +
            "\"time\": \"20170302113000\"," +
            "\"ret_code\": 0," +
            "\"alarmList\": [" +
            "{" +
            "\"signalLevel\": \"蓝色\"," +
            "\"issueContent\": \"北京市气象台28日16时00分发布大风蓝色预警,    受冷空气影响，预计28日夜间至3月1日，本市将有4、5级偏北风，阵风可达7级左右，请注意防范。\"," +
            "\"issueTime\": \"2017-02-28 16:00:00\"," +
            "\"province\": \"北京市\"," +
            "\"signalType\": \"大风\"," +
            "\"city\": \"\"" +
            "}" +
            "]," +
            "\"cityInfo\": {" +
            "\"c6\": \"beijing\"," +
            "\"c5\": \"北京\"," +
            "\"c4\": \"beijing\"," +
            "\"c3\": \"北京\"," +
            "\"c9\": \"中国\"," +
            "\"c8\": \"china\"," +
            "\"c7\": \"北京\"," +
            "\"c17\": \"+8\"," +
            "\"c16\": \"AZ9010\"," +
            "\"c1\": \"101010100\"," +
            "\"c2\": \"beijing\"," +
            "\"longitude\": 116.391," +
            "\"c11\": \"010\"," +
            "\"latitude\": 39.904," +
            "\"c10\": \"1\"," +
            "\"c12\": \"100000\"," +
            "\"c15\": \"33\"" +
            "}," +
            "\"now\": {" +
            "\"aqiDetail\": {" +
            "\"co\": 1.08," +
            "\"so2\": 15," +
            "\"area\": \"北京\"," +
            "\"o3\": 36," +
            "\"no2\": 64," +
            "\"area_code\": \"beijing\"," +
            "\"quality\": \"良\"," +
            "\"aqi\": 67," +
            "\"pm10\": 77," +
            "\"pm2_5\": 48," +
            "\"o3_8h\": 26," +
            "\"primary_pollutant\": \"颗粒物(PM2.5)\"" +
            "}," +
            "\"weather_code\": \"00\"," +
            "\"wind_direction\": \"西南风\"," +
            "\"temperature_time\": \"13:30\"," +
            "\"wind_power\": \"2级\"," +
            "\"aqi\": 67," +
            "\"sd\": \"15%\"," +
            "\"weather_pic\": \"http://appimg.showapi.com/images/weather/icon/day/00.png\"," +
            "\"weather\": \"晴\"," +
            "\"temperature\": \"12\"" +
            "}," +
            "\"f1\": {" +
            "\"day_weather\": \"晴\"," +
            "\"night_weather\": \"晴\"," +
            "\"night_weather_code\": \"00\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气较好，适宜约会\"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气不错，抓紧时机让衣物晒太阳吧。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"不适宜钓鱼\"," +
            "\"desc\": \"天气不好，不适合垂钓\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"温较低，推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"暖阳万丈，温度舒适，会觉得精神振奋。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风大，需注意及时添衣。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"较易发\"," +
            "\"desc\": \"天较凉，增加衣服，注意防护。\"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风稍大，出门逛街前记得给秀发定型。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"普遍感觉舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"较不宜晨练 \"," +
            "\"desc\": \"受天气影响，较不宜晨练。\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"必要\"," +
            "\"desc\": \"建议佩戴透射比为1级的遮阳镜\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"低\"," +
            "\"desc\": \"空气质量好，无需防护\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"开启制暖空调\"," +
            "\"desc\": \"体感略冷，建议开启暖空调调节室温。\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"无雨且风力较小，易保持清洁度。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"一般\"," +
            "\"desc\": \"注意清洁，建议选用防晒滋润型护发品。\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"易过敏 \"," +
            "\"desc\": \"请尽量减少外出。\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"较不适宜\"," +
            "\"desc\": \"有些凉意，少量饮用常温啤酒。\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"可以尽情外出享受夜生活的乐趣。\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"好天气，放风筝可以舒展筋骨放松身心。\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"0%\"," +
            "\"night_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_wind_power\": \"3-4级 5.5~7.9m/s\"," +
            "\"day_weather_code\": \"00\"," +
            "\"sun_begin_end\": \"06:47|18:07\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/00.png\"," +
            "\"weekday\": 4," +
            "\"night_air_temperature\": \"-2\"," +
            "\"day_air_temperature\": \"13\"," +
            "\"day_wind_direction\": \"南风\"," +
            "\"day\": \"20170302\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/00.png\"," +
            "\"night_wind_direction\": \"南风\"" +
            "}," +
            "\"f3\": {" +
            "\"day_weather\": \"多云\"," +
            "\"night_weather\": \"多云\"," +
            "\"night_weather_code\": \"01\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"不用担心天气来调皮捣乱而影响了兴致。 \"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"不适宜\"," +
            "\"desc\": \"天气阴沉，不太适宜晾晒。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"不适宜钓鱼\"," +
            "\"desc\": \"天气不好，不适合垂钓\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"温较低，推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"暖阳万丈，温度舒适，会觉得精神振奋。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"气温低注意及时添衣，小心着凉。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"少发\"," +
            "\"desc\": \"无明显降温，感冒机率较低。\"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"这种好天气去逛街可使身心畅快放松。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"普遍感觉舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"中\"," +
            "\"desc\": \"易感人群应适当减少室外活动。\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"无雨且风力较小，易保持清洁度。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"13%\"," +
            "\"night_wind_power\": \"3-4级 5.5~7.9m/s\"," +
            "\"day_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_weather_code\": \"01\"," +
            "\"sun_begin_end\": \"06:44|18:09\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/01.png\"," +
            "\"weekday\": 6," +
            "\"night_air_temperature\": \"0\"," +
            "\"day_air_temperature\": \"13\"," +
            "\"day_wind_direction\": \"北风\"," +
            "\"day\": \"20170304\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/01.png\"," +
            "\"night_wind_direction\": \"北风\"" +
            "}," +
            "\"f2\": {" +
            "\"day_weather\": \"晴\"," +
            "\"night_weather\": \"晴\"," +
            "\"night_weather_code\": \"00\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"不用担心天气来调皮捣乱而影响了兴致。 \"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气不错，抓紧时机让衣物晒太阳吧。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"天气稍凉会对垂钓产生一定影响。\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"温较低，推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"温度适宜，心情会不错。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"气温低注意及时添衣，小心着凉。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"较易发\"," +
            "\"desc\": \"温差较大，较易感冒，注意防护。\"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"这种好天气去逛街可使身心畅快放松。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"普遍感觉舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"中\"," +
            "\"desc\": \"易感人群应适当减少室外活动。\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"无雨且风力较小，易保持清洁度。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"0%\"," +
            "\"night_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_weather_code\": \"00\"," +
            "\"sun_begin_end\": \"06:46|18:08\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/00.png\"," +
            "\"weekday\": 5," +
            "\"night_air_temperature\": \"-2\"," +
            "\"day_air_temperature\": \"12\"," +
            "\"day_wind_direction\": \"南风\"," +
            "\"day\": \"20170303\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/00.png\"," +
            "\"night_wind_direction\": \"东北风\"" +
            "}," +
            "\"f5\": {" +
            "\"day_weather\": \"晴\"," +
            "\"night_weather\": \"多云\"," +
            "\"night_weather_code\": \"01\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"不用担心天气来调皮捣乱而影响了兴致。 \"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"适宜晾晒 天气不错，适宜晾晒衣物。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"不适宜钓鱼\"," +
            "\"desc\": \"天气不好，不适合垂钓\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"温较低，推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"暖阳万丈，温度舒适，会觉得精神振奋。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风大，需注意及时添衣。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"较易发\"," +
            "\"desc\": \"天凉温差大，适当增减衣服。 昼夜温差很大，注意预防感冒。  \"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风稍大，出门逛街前记得给秀发定型。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"偏凉或凉，部分人感觉不舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"良\"," +
            "\"desc\": \"气象条件有利于空气污染物扩散。\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"无雨且风力较小，易保持清洁度。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"0%\"," +
            "\"night_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_wind_power\": \"3-4级 5.5~7.9m/s\"," +
            "\"day_weather_code\": \"00\"," +
            "\"sun_begin_end\": \"06:41|18:11\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/00.png\"," +
            "\"weekday\": 1," +
            "\"night_air_temperature\": \"-1\"," +
            "\"day_air_temperature\": \"12\"," +
            "\"day_wind_direction\": \"北风\"," +
            "\"day\": \"20170306\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/01.png\"," +
            "\"night_wind_direction\": \"北风\"" +
            "}," +
            "\"f4\": {" +
            "\"day_weather\": \"晴\"," +
            "\"night_weather\": \"晴\"," +
            "\"night_weather_code\": \"00\"," +
            "\"index\": {" +
            "\"yh\": {" +
            "\"title\": \"不适宜\"," +
            "\"desc\": \"风力较大，请您挑选避风的地点。\"" +
            "}," +
            "\"ls\": {" +
            "\"title\": \"适宜\"," +
            "\"desc\": \"适宜晾晒 天气不错，适宜晾晒衣物。\"" +
            "}," +
            "\"clothes\": {" +
            "\"title\": \"较冷\"," +
            "\"desc\": \"建议着厚外套加毛衣等服装。\"" +
            "}," +
            "\"dy\": {" +
            "\"title\": \"不适宜钓鱼\"," +
            "\"desc\": \"天气不好，不适合垂钓\"" +
            "}," +
            "\"sports\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"温较低，推荐您进行室内运动。\"" +
            "}," +
            "\"travel\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"较弱降水和微风将伴您共赴旅程。\"" +
            "}," +
            "\"beauty\": {" +
            "\"title\": \"滋润保湿\"," +
            "\"desc\": \"请选用滋润保湿型化妆品。\"" +
            "}," +
            "\"xq\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"晴朗天气，将为您的身心带来温暖。\"" +
            "}," +
            "\"hc\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风大，需注意及时添衣。\"" +
            "}," +
            "\"zs\": {" +
            "\"title\": \"不容易中暑\"," +
            "\"desc\": \"气温不高，中暑几率极低。\"" +
            "}," +
            "\"cold\": {" +
            "\"title\": \"较易发\"," +
            "\"desc\": \"天凉温差大，适当增减衣服。 昼夜温差很大，注意预防感冒。  \"" +
            "}," +
            "\"gj\": {" +
            "\"title\": \"较适宜\"," +
            "\"desc\": \"风稍大，出门逛街前记得给秀发定型。\"" +
            "}," +
            "\"comfort\": {" +
            "\"title\": \"较好\"," +
            "\"desc\": \"偏凉或凉，部分人感觉不舒适\"" +
            "}," +
            "\"uv\": {" +
            "\"title\": \"中等\"," +
            "\"desc\": \"涂擦SPF大于15、PA+防晒护肤品。\"" +
            "}," +
            "\"cl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"glass\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"aqi\": {" +
            "\"title\": \"良\"," +
            "\"desc\": \"气象条件有利于空气污染物扩散。\"" +
            "}," +
            "\"ac\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"wash_car\": {" +
            "\"title\": \"较不适宜\"," +
            "\"desc\": \"风力较大，洗车后会蒙上灰尘。\"" +
            "}," +
            "\"mf\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"ag\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pj\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"nl\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}," +
            "\"pk\": {" +
            "\"title\": \"暂缺\"," +
            "\"desc\": \"暂缺\"" +
            "}" +
            "}," +
            "\"air_press\": \"1021 hPa\"," +
            "\"jiangshui\": \"0%\"," +
            "\"night_wind_power\": \"微风 <5.4m/s\"," +
            "\"day_wind_power\": \"4-5级 8.0~10.7m/s\"," +
            "\"day_weather_code\": \"00\"," +
            "\"sun_begin_end\": \"06:43|18:10\"," +
            "\"ziwaixian\": \"中等\"," +
            "\"day_weather_pic\": \"http://app1.showapi.com/weather/icon/day/00.png\"," +
            "\"weekday\": 7," +
            "\"night_air_temperature\": \"-1\"," +
            "\"day_air_temperature\": \"11\"," +
            "\"day_wind_direction\": \"北风\"," +
            "\"day\": \"20170305\"," +
            "\"night_weather_pic\": \"http://app1.showapi.com/weather/icon/night/00.png\"," +
            "\"night_wind_direction\": \"西北风\"" +
            "}" +
            "}" +
            "}";

}
