package com.ard.weather.util;

import com.ard.weather.activity.MainActivity;
import com.ard.weather.activity.R;

import android.support.v4.view.ViewPager;
import android.support.v4.widget.DrawerLayout.LayoutParams;
import android.view.LayoutInflater;
import android.view.View;
import android.view.View.OnClickListener;
import android.widget.PopupWindow;
import android.widget.Toast;

public interface UtilInterface {

	String EXENERWORKAVAILABLE = "数据访问错误,是否重新查询";
	String NetworkAvailableException = "网络为连接,请开启网络";
	String LocationException = "定位失败！是否进入查询模式";
	String SELECTCITY = "查询失败,请正确填写城市！";
	int REQUEST_CODE = 1;
	int RESULTCODE = 1;

	String[] STRVIEWNAME = { "北京", "上海", "云南", "四川", "台湾", "天津", "吉林", "宁夏", "安徽", "山东", "山西", "广东", "广西", "新疆", "江苏",
			"江西", "河北", "河南", "浙江", "海南", "湖北", "湖南", "澳门", "甘肃", "福建", "西藏", "贵州", "辽宁", "重庆", "陕西", "青海", "香港",
			"黑龙江" };
	String[][] STRCITYNAME = { { "北京", "平谷", "密云", "通县", "顺义", "怀柔", "大兴" },
			{ "宝山", "崇明", "奉贤", "嘉定", "金山", "南汇", "浦东", "青浦", "松江", "徐家汇" },
			{ "昆明", "曲靖", "玉溪", "昭通", "楚雄", "普洱", "景洪", "大理", "保山", "丽江", "临沧", "宣威", "个旧", "文山", "安宁", "瑞丽", "芒康" },
			{ "成都", "都江堰", "彭州", "崇州", "邛崃", "自贡", "攀枝花", "泸州", "德阳", "绵竹", "广元", "遂宁", "内江", "乐山", "峨眉山", "南充", "阆中",
					" 眉山", "宜宾", "广安", "达州", "雅安", "巴中", "简阳", "甘.孜藏族自治州", "凉山彝族自治州" },
			{ "新竹", "台中", "嘉义", "台南", "台北", "宜兰", "桃园", "台中", "彰化", "南投", "云林", "嘉义", "台南", "高雄", "屏东", "台东", "花莲" },

			{ "天津", "和平" },

			{ "长春", "四平", "通化", "白山", "辽源", "白城", "松原" }, { "银川", "石嘴山", "吴忠", "固原", "中卫", "青铜峡", "灵武" },
			{ "安庆", "蚌埠", "亳州", "长丰", "巢湖", "池州", "滁州", "枞阳", "当涂", "砀山", "定远", "冬至", "繁昌", "肥东", "肥西", "凤台", "凤阳",
					"阜南", "阜阳", "固镇", "广德", "含山", "合肥", "和县", "怀宁", "怀远", "淮北", "淮南", "黄山", "霍邱", "霍山", "绩溪", "界首",
					"金寨", "泾县", "旌德", "九华山", "来安", "郎溪", "利辛", "临泉", "灵璧", "六安", "庐江", "马鞍山", "蒙城", "明光", "南陵", "宁国",
					"祁门", "潜山", "青阳", "全椒", "石台", "寿县", "舒城", "泗县", "宿松", "宿州", "濉溪", "太和", "太湖", "天长", "桐城", "铜陵",
					"屯溪", "望江", "涡阳", "无为", "芜湖", "芜湖", "五河", "歙县", "萧县", "休宁", "宣城", "黟县", "颍上", "岳西" },
			{ "济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽" },
			{ "太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁" },
			{ "广州", "深圳", "珠海", "汕头", "韶关", "河源", "惠州", "汕尾", "东莞", "中山", "江门", "佛山", "阳江", "湛江", "肇庆", "清远", "潮州" },
			{ "南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左" },
			{ "乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "阿克苏", "喀什", "和田", "塔城", "阿勒泰" },
			{ "高邮", "南京", "镇江", "常州", "无锡", "苏州", "连云港", "盐城", "南通", "徐州", "宿迁", "淮安", "扬州", "泰州" },
			{ "新干", "南昌", "景德镇", "萍乡", "九江", "新余", "赣州", "吉安", "宜春", "抚州", "上饶" },
			{ "石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水" },
			{ "靖边", "郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口",
					"驻马店", "济源" },
			{ "杭州", "宁波", "温州", "绍兴", "湖州", "嘉兴", "金华", "衢州", "台州", "丽水", "舟山" }, { "海口", "三亚" },
			{ "武汉", "黄石", "襄樊", "十堰", "荆州", "宜昌", "荆门", "鄂州", "孝感", "黄冈", "咸宁", "随州" },
			{ "长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西" }, { "澳门" },
			{ "兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "张掖", "酒泉", "崆峒", "庆阳", "安定", "武都", "临夏回族自治州", "甘南藏族自治州" },
			{ "尤溪", "福州", "厦门", "泉州", "莆田", "漳州", "南平", "龙岩", "三明", "宁德" },
			{ "拉萨", "昌都", "林芝", "乃东", "日喀则", "那曲", "阿里" },
			{ "贵州修文", "清镇", "遵义汇川", "赤水", "仁怀", "安顺", "毕节", "富源", "都匀", "福泉", "铜仁", "凯里" },
			{ "沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘山", "铁岭", "大兴", "葫芦岛" },
			{ "重庆", "巫山", "奉节", "铜仁", "云阳", "武隆", "城口", "开县", "忠县", "梁平", "丰都", "涪陵", "垫江", "南川", "长寿", "綦江", "合川",
					"潼南", "荣昌", "铜梁", "永川", "大足" },
			{ "洛川", "西安", "咸阳", "山阳", "安康", "汉中", "延安", "渭南", "铜川", "榆阳" },
			{ "青海", "西宁", "平安", "共和", "黄南", "达日", "玉树", "德令哈" }, { "香港", "九龙" },
			{ "庆安", "哈尔滨", "齐齐哈尔", "鸡西", "鹤岗", "双鸭山", "大庆", "伊春", "佳木斯", "七台河", "牡丹江", "黑河", "绥化", "大兴安岭" }

	};

	int[] strImg = { R.drawable.beijing, R.drawable.shanghai, R.drawable.yunlan, R.drawable.sichuang, R.drawable.taiwan,
			R.drawable.tainjing, R.drawable.jiling, R.drawable.ningxia, R.drawable.anhui, R.drawable.shandong,
			R.drawable.shanxi, R.drawable.guangdong, R.drawable.guangxi, R.drawable.xinjiang, R.drawable.jiangsu,
			R.drawable.jiangxi, R.drawable.hebei, R.drawable.heinan, R.drawable.zhejiang, R.drawable.hunan,
			R.drawable.hubei, R.drawable.hainan, R.drawable.aomeng, R.drawable.gansu, R.drawable.fujian,
			R.drawable.xizang, R.drawable.guizhou, R.drawable.lning, R.drawable.chongq, R.drawable.shanxi,
			R.drawable.qinghai, R.drawable.xianggang, R.drawable.heilongjiang };
	String WEATHERSTRLS = "基本适宜";
	String WEATHERSTRGLSASS = "不需要";
	String WEATHERSTRDY = "不宜";
	String WEATHERYJ = ("预警:" + "蓝色" + "~雾");

}
